# Pandas
- **Pandas** is a fast, powerful and easy to use open source data analysis and manipulation library.
1. Series
2. DataFrame

# Series

In [165]:
import numpy as np
import pandas as pd

**Create Series**

In [166]:
s=pd.Series(('ab','xy','mn','op','ef'))
s

0    ab
1    xy
2    mn
3    op
4    ef
dtype: object

In [167]:
type(s)

pandas.core.series.Series

In [168]:
s.values

array(['ab', 'xy', 'mn', 'op', 'ef'], dtype=object)

In [169]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [170]:
list(s.index)

[0, 1, 2, 3, 4]

In [171]:
tuple(s.index)

(0, 1, 2, 3, 4)

In [172]:
s.index=[10,20,30,40,50]
s

10    ab
20    xy
30    mn
40    op
50    ef
dtype: object

In [173]:
s.index=range(101,106)
s

101    ab
102    xy
103    mn
104    op
105    ef
dtype: object

**Accessing data in series**
1. loc -label based indexing (aapan deu ti index)
2. iloc - position based indexing (automatic yete ti index 0 pasun)

In [174]:
s.loc[104]

'op'

In [175]:
s.iloc[0]

'ab'

In [176]:
s.iloc[1]

'xy'

In [177]:
s.iloc[4]

'ef'

**slicing in Series**

In [178]:
s[0:4]

101    ab
102    xy
103    mn
104    op
dtype: object

In [179]:
s[0:5:2]

101    ab
103    mn
105    ef
dtype: object

In [180]:
s[:]

101    ab
102    xy
103    mn
104    op
105    ef
dtype: object

In [181]:
s[::-1]

105    ef
104    op
103    mn
102    xy
101    ab
dtype: object

In [182]:
s[::2]

101    ab
103    mn
105    ef
dtype: object

**add row in Series**

In [183]:
s[5]='vw'
s

101    ab
102    xy
103    mn
104    op
105    ef
5      vw
dtype: object

In [184]:
s[106]='vw'
s

101    ab
102    xy
103    mn
104    op
105    ef
5      vw
106    vw
dtype: object

In [185]:
s[107]='op'
s

101    ab
102    xy
103    mn
104    op
105    ef
5      vw
106    vw
107    op
dtype: object

In [186]:
s[2]='XY'
s

101    ab
102    xy
103    mn
104    op
105    ef
5      vw
106    vw
107    op
2      XY
dtype: object

**update**- change value

In [187]:
s[107]='vi'
s

101    ab
102    xy
103    mn
104    op
105    ef
5      vw
106    vw
107    vi
2      XY
dtype: object

In [188]:
s[102]='XY'
s

101    ab
102    XY
103    mn
104    op
105    ef
5      vw
106    vw
107    vi
2      XY
dtype: object

In [189]:
s[2]='AB'
s

101    ab
102    XY
103    mn
104    op
105    ef
5      vw
106    vw
107    vi
2      AB
dtype: object

**Delete**- delete row

In [190]:
s.drop(5,inplace=True)

In [191]:
s.drop(2,inplace=True)

In [192]:
s

101    ab
102    XY
103    mn
104    op
105    ef
106    vw
107    vi
dtype: object

# DataFrame

In [193]:
import numpy as np
import pandas as pd

**Create DataFrame**

In [194]:
Student1=pd.Series({'Name':'Vaishnavi','Roll_No':1,'age':21,'Subject':'Python','Marks':91})
Student2=pd.Series({'Name':'Mayur','Roll_No':2,'age':20,'Subject':'Web Development','Marks':90})
Student3=pd.Series({'Name':'Ritesh','Roll_No':3,'age':22,'Subject':'Java','Marks':94})
Student4=pd.Series({'Name':'Seema','Roll_No':4,'age':22,'Subject':'Data Analytics','Marks':91})
Student5=pd.Series({'Name':'Rohini','Roll_No':5,'age':21,'Subject':'UiUx','Marks':98})
Student6=pd.Series({'Name':'Vaibhav','Roll_No':6,'age':21,'Subject':'Web Development','Marks':93})
Student7=pd.Series({'Name':'Khushi','Roll_No':7,'age':22,'Subject':'Java','Marks':92})
Student8=pd.Series({'Name':'Sayali','Roll_No':8,'age':20,'Subject':'Data Analytics','Marks':81})
Student9=pd.Series({'Name':'Divya','Roll_No':9,'age':19,'Subject':'Java','Marks':88})
Student10=pd.Series({'Name':'Kartik','Roll_No':10,'age':19,'Subject':'Web Development','Marks':79})
Student11=pd.Series({'Name':'Rohit','Roll_No':11,'age':20,'Subject':'UiUx','Marks':78})
Student12=pd.Series({'Name':'Abhir','Roll_No':12,'age':20,'Subject':'Java','Marks':89})
Student13=pd.Series({'Name':'Rashi','Roll_No':13,'age':21,'Subject':'Java','Marks':97})
Student14=pd.Series({'Name':'Anshuman','Roll_No':14,'age':18,'Subject':'Web Development','Marks':67})
Student15=pd.Series({'Name':'Harshal','Roll_No':15,'age':19,'Subject':'Data Analytics','Marks':69})
Student16=pd.Series({'Name':'Sakshi','Roll_No':16,'age':22,'Subject':'Java','Marks':78})
Student17=pd.Series({'Name':'Jasmin','Roll_No':17,'age':21,'Subject':'UiUx','Marks':92})
Student18=pd.Series({'Name':'Mukesh','Roll_No':18,'age':20,'Subject':'Data Analytics','Marks':91})
Student19=pd.Series({'Name':'Arjun','Roll_No':19,'age':19,'Subject':'Java','Marks':71})
Student20=pd.Series({'Name':'Sidhart','Roll_No':20,'age':19,'Subject':'UiUx','Marks':63})

In [195]:
Students=[Student1,Student2,Student3,Student4,Student5,Student6,Student7,Student8,Student9,Student10,Student11,Student12,Student13,Student14,Student15,Student16,Student17,Student18,Student19,Student20]
df=pd.DataFrame(Students)
df

         Name  Roll_No  age          Subject  Marks
0   Vaishnavi        1   21           Python     91
1       Mayur        2   20  Web Development     90
2      Ritesh        3   22             Java     94
3       Seema        4   22   Data Analytics     91
4      Rohini        5   21             UiUx     98
5     Vaibhav        6   21  Web Development     93
6      Khushi        7   22             Java     92
7      Sayali        8   20   Data Analytics     81
8       Divya        9   19             Java     88
9      Kartik       10   19  Web Development     79
10      Rohit       11   20             UiUx     78
11      Abhir       12   20             Java     89
12      Rashi       13   21             Java     97
13   Anshuman       14   18  Web Development     67
14    Harshal       15   19   Data Analytics     69
15     Sakshi       16   22             Java     78
16     Jasmin       17   21             UiUx     92
17     Mukesh       18   20   Data Analytics     91
18      Arjun       19   19             Java     71
19    Sidhart       20   19             UiUx     63

In [196]:
df.index=range(101,121)
df

          Name  Roll_No  age          Subject  Marks
101  Vaishnavi        1   21           Python     91
102      Mayur        2   20  Web Development     90
103     Ritesh        3   22             Java     94
104      Seema        4   22   Data Analytics     91
105     Rohini        5   21             UiUx     98
106    Vaibhav        6   21  Web Development     93
107     Khushi        7   22             Java     92
108     Sayali        8   20   Data Analytics     81
109      Divya        9   19             Java     88
110     Kartik       10   19  Web Development     79
111      Rohit       11   20             UiUx     78
112      Abhir       12   20             Java     89
113      Rashi       13   21             Java     97
114   Anshuman       14   18  Web Development     67
115    Harshal       15   19   Data Analytics     69
116     Sakshi       16   22             Java     78
117     Jasmin       17   21             UiUx     92
118     Mukesh       18   20   Data Analytics     91
119      Arjun       19   19             Java     71
120    Sidhart       20   19             UiUx     63

In [197]:
df.head()   # first five rows

          Name  Roll_No  age          Subject  Marks
101  Vaishnavi        1   21           Python     91
102      Mayur        2   20  Web Development     90
103     Ritesh        3   22             Java     94
104      Seema        4   22   Data Analytics     91
105     Rohini        5   21             UiUx     98

In [198]:
df.head(10)     # First 10 rows

          Name  Roll_No  age          Subject  Marks
101  Vaishnavi        1   21           Python     91
102      Mayur        2   20  Web Development     90
103     Ritesh        3   22             Java     94
104      Seema        4   22   Data Analytics     91
105     Rohini        5   21             UiUx     98
106    Vaibhav        6   21  Web Development     93
107     Khushi        7   22             Java     92
108     Sayali        8   20   Data Analytics     81
109      Divya        9   19             Java     88
110     Kartik       10   19  Web Development     79

In [199]:
df.tail()    # last five rows

        Name  Roll_No  age         Subject  Marks
116   Sakshi       16   22            Java     78
117   Jasmin       17   21            UiUx     92
118   Mukesh       18   20  Data Analytics     91
119    Arjun       19   19            Java     71
120  Sidhart       20   19            UiUx     63

In [200]:
df.tail(10)     # last 10 rows

         Name  Roll_No  age          Subject  Marks
111     Rohit       11   20             UiUx     78
112     Abhir       12   20             Java     89
113     Rashi       13   21             Java     97
114  Anshuman       14   18  Web Development     67
115   Harshal       15   19   Data Analytics     69
116    Sakshi       16   22             Java     78
117    Jasmin       17   21             UiUx     92
118    Mukesh       18   20   Data Analytics     91
119     Arjun       19   19             Java     71
120   Sidhart       20   19             UiUx     63

In [201]:
df.info()     # table information
              # (object means string)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 101 to 120
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     20 non-null     object
 1   Roll_No  20 non-null     int64
 2   age      20 non-null     int64
 3   Subject  20 non-null     object
 4   Marks    20 non-null     int64
dtypes: int64(3), object(2)
memory usage: 932.0+ bytes

In [202]:
df.values    # output is 2d array

array([['Vaishnavi', 1, 21, 'Python', 91],
       ['Mayur', 2, 20, 'Web Development', 90],
       ['Ritesh', 3, 22, 'Java', 94],
       ['Seema', 4, 22, 'Data Analytics', 91],
       ['Rohini', 5, 21, 'UiUx', 98],
       ['Vaibhav', 6, 21, 'Web Development', 93],
       ['Khushi', 7, 22, 'Java', 92],
       ['Sayali', 8, 20, 'Data Analytics', 81],
       ['Divya', 9, 19, 'Java', 88],
       ['Kartik', 10, 19, 'Web Development', 79],
       ['Rohit', 11, 20, 'UiUx', 78],
       ['Abhir', 12, 20, 'Java', 89],
       ['Rashi', 13, 21, 'Java', 97],
       ['Anshuman', 14, 18, 'Web Development', 67],
       ['Harshal', 15, 19, 'Data Analytics', 69],
       ['Sakshi', 16, 22, 'Java', 78],
       ['Jasmin', 17, 21, 'UiUx', 92],
       ['Mukesh', 18, 20, 'Data Analytics', 91],
       ['Arjun', 19, 19, 'Java', 71],
       ['Sidhart', 20, 19, 'UiUx', 63]], dtype=object)

In [203]:
df.index   # range index

RangeIndex(start=101, stop=121, step=1)

In [204]:
list(df.index)    # list for index

[101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120]

In [205]:
tuple(df.index)    # tuple for index

(101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120)

In [206]:
set(df.index)        # set for index

{101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120}

**Accessing data in DataFrame**
1. loc -label based indexing (aapan deu ti index)
2. iloc - position based indexing (automatic yete ti index 0 pasun)

In [207]:
df.loc[103]  # one record  access using loc

Name       Ritesh
Roll_No         3
age            22
Subject      Java
Marks          94
Name: 103, dtype: object

In [208]:
df.loc[range(102,111,2)]   # even record access for given range using loc

        Name  Roll_No  age          Subject  Marks
102    Mayur        2   20  Web Development     90
104    Seema        4   22   Data Analytics     91
106  Vaibhav        6   21  Web Development     93
108   Sayali        8   20   Data Analytics     81
110   Kartik       10   19  Web Development     79

In [209]:
df.loc[[105,109,113]]      # multiple record access using loc

       Name  Roll_No  age Subject  Marks
105  Rohini        5   21    UiUx     98
109   Divya        9   19    Java     88
113   Rashi       13   21    Java     97

In [210]:
df.iloc[5]    # single record access using iloc

Name               Vaibhav
Roll_No                  6
age                     21
Subject    Web Development
Marks                   93
Name: 106, dtype: object

In [211]:
df.iloc[[4,8,19,10]]      # multiple record access using iloc

        Name  Roll_No  age Subject  Marks
105   Rohini        5   21    UiUx     98
109    Divya        9   19    Java     88
120  Sidhart       20   19    UiUx     63
111    Rohit       11   20    UiUx     78

In [212]:
df.iloc[range(0,12,2)]

          Name  Roll_No  age Subject  Marks
101  Vaishnavi        1   21  Python     91
103     Ritesh        3   22    Java     94
105     Rohini        5   21    UiUx     98
107     Khushi        7   22    Java     92
109      Divya        9   19    Java     88
111      Rohit       11   20    UiUx     78

In [213]:
df[['Name','age']]     # accessing two columns

          Name  age
101  Vaishnavi   21
102      Mayur   20
103     Ritesh   22
104      Seema   22
105     Rohini   21
106    Vaibhav   21
107     Khushi   22
108     Sayali   20
109      Divya   19
110     Kartik   19
111      Rohit   20
112      Abhir   20
113      Rashi   21
114   Anshuman   18
115    Harshal   19
116     Sakshi   22
117     Jasmin   21
118     Mukesh   20
119      Arjun   19
120    Sidhart   19

In [214]:
df['Name']     # single column acess

101    Vaishnavi
102        Mayur
103       Ritesh
104        Seema
105       Rohini
106      Vaibhav
107       Khushi
108       Sayali
109        Divya
110       Kartik
111        Rohit
112        Abhir
113        Rashi
114     Anshuman
115      Harshal
116       Sakshi
117       Jasmin
118       Mukesh
119        Arjun
120      Sidhart
Name: Name, dtype: object

In [215]:
df.loc[[115,117,103,108]]["Name"]

115    Harshal
117     Jasmin
103     Ritesh
108     Sayali
Name: Name, dtype: object

**Adding row and column**

In [216]:
df.loc[121]=('soni',21,24,'Java',78)    # adding row using loc
df                                      # iloc se row add nahi hoti

          Name  Roll_No  age          Subject  Marks
101  Vaishnavi        1   21           Python     91
102      Mayur        2   20  Web Development     90
103     Ritesh        3   22             Java     94
104      Seema        4   22   Data Analytics     91
105     Rohini        5   21             UiUx     98
106    Vaibhav        6   21  Web Development     93
107     Khushi        7   22             Java     92
108     Sayali        8   20   Data Analytics     81
109      Divya        9   19             Java     88
110     Kartik       10   19  Web Development     79
111      Rohit       11   20             UiUx     78
112      Abhir       12   20             Java     89
113      Rashi       13   21             Java     97
114   Anshuman       14   18  Web Development     67
115    Harshal       15   19   Data Analytics     69
116     Sakshi       16   22             Java     78
117     Jasmin       17   21             UiUx     92
118     Mukesh       18   20   Data Analytics     91
119      Arjun       19   19             Java     71
120    Sidhart       20   19             UiUx     63
121       soni       21   24             Java     78

In [217]:
df['Address']='Pune'   # adding the column for default value
df

          Name  Roll_No  age          Subject  Marks Address
101  Vaishnavi        1   21           Python     91    Pune
102      Mayur        2   20  Web Development     90    Pune
103     Ritesh        3   22             Java     94    Pune
104      Seema        4   22   Data Analytics     91    Pune
105     Rohini        5   21             UiUx     98    Pune
106    Vaibhav        6   21  Web Development     93    Pune
107     Khushi        7   22             Java     92    Pune
108     Sayali        8   20   Data Analytics     81    Pune
109      Divya        9   19             Java     88    Pune
110     Kartik       10   19  Web Development     79    Pune
111      Rohit       11   20             UiUx     78    Pune
112      Abhir       12   20             Java     89    Pune
113      Rashi       13   21             Java     97    Pune
114   Anshuman       14   18  Web Development     67    Pune
115    Harshal       15   19   Data Analytics     69    Pune
116     Sakshi       16   22             Java     78    Pune
117     Jasmin       17   21             UiUx     92    Pune
118     Mukesh       18   20   Data Analytics     91    Pune
119      Arjun       19   19             Java     71    Pune
120    Sidhart       20   19             UiUx     63    Pune
121       soni       21   24             Java     78    Pune

In [218]:
df['Attendance']=np.random.randint(40,90,21)
df                                                     # adding column using random

          Name  Roll_No  age          Subject  Marks Address  Attendance
101  Vaishnavi        1   21           Python     91    Pune          83
102      Mayur        2   20  Web Development     90    Pune          58
103     Ritesh        3   22             Java     94    Pune          50
104      Seema        4   22   Data Analytics     91    Pune          48
105     Rohini        5   21             UiUx     98    Pune          81
106    Vaibhav        6   21  Web Development     93    Pune          88
107     Khushi        7   22             Java     92    Pune          45
108     Sayali        8   20   Data Analytics     81    Pune          65
109      Divya        9   19             Java     88    Pune          65
110     Kartik       10   19  Web Development     79    Pune          48
111      Rohit       11   20             UiUx     78    Pune          51
112      Abhir       12   20             Java     89    Pune          61
113      Rashi       13   21             Java     97    Pune          71
114   Anshuman       14   18  Web Development     67    Pune          85
115    Harshal       15   19   Data Analytics     69    Pune          40
116     Sakshi       16   22             Java     78    Pune          47
117     Jasmin       17   21             UiUx     92    Pune          85
118     Mukesh       18   20   Data Analytics     91    Pune          89
119      Arjun       19   19             Java     71    Pune          88
120    Sidhart       20   19             UiUx     63    Pune          75
121       soni       21   24             Java     78    Pune          70

**Remove column and row**

<ul><li>0-axis   -  row</li>
    <li>1-axis   - column</li> 
    <li>inplace = True   - permentaly delate</li>
</ul>

In [219]:
df.drop('Attendance',axis=1,inplace=True)  
df

          Name  Roll_No  age          Subject  Marks Address
101  Vaishnavi        1   21           Python     91    Pune
102      Mayur        2   20  Web Development     90    Pune
103     Ritesh        3   22             Java     94    Pune
104      Seema        4   22   Data Analytics     91    Pune
105     Rohini        5   21             UiUx     98    Pune
106    Vaibhav        6   21  Web Development     93    Pune
107     Khushi        7   22             Java     92    Pune
108     Sayali        8   20   Data Analytics     81    Pune
109      Divya        9   19             Java     88    Pune
110     Kartik       10   19  Web Development     79    Pune
111      Rohit       11   20             UiUx     78    Pune
112      Abhir       12   20             Java     89    Pune
113      Rashi       13   21             Java     97    Pune
114   Anshuman       14   18  Web Development     67    Pune
115    Harshal       15   19   Data Analytics     69    Pune
116     Sakshi       16   22             Java     78    Pune
117     Jasmin       17   21             UiUx     92    Pune
118     Mukesh       18   20   Data Analytics     91    Pune
119      Arjun       19   19             Java     71    Pune
120    Sidhart       20   19             UiUx     63    Pune
121       soni       21   24             Java     78    Pune

In [220]:
df.drop(104,axis=0,inplace=True)
df

          Name  Roll_No  age          Subject  Marks Address
101  Vaishnavi        1   21           Python     91    Pune
102      Mayur        2   20  Web Development     90    Pune
103     Ritesh        3   22             Java     94    Pune
105     Rohini        5   21             UiUx     98    Pune
106    Vaibhav        6   21  Web Development     93    Pune
107     Khushi        7   22             Java     92    Pune
108     Sayali        8   20   Data Analytics     81    Pune
109      Divya        9   19             Java     88    Pune
110     Kartik       10   19  Web Development     79    Pune
111      Rohit       11   20             UiUx     78    Pune
112      Abhir       12   20             Java     89    Pune
113      Rashi       13   21             Java     97    Pune
114   Anshuman       14   18  Web Development     67    Pune
115    Harshal       15   19   Data Analytics     69    Pune
116     Sakshi       16   22             Java     78    Pune
117     Jasmin       17   21             UiUx     92    Pune
118     Mukesh       18   20   Data Analytics     91    Pune
119      Arjun       19   19             Java     71    Pune
120    Sidhart       20   19             UiUx     63    Pune
121       soni       21   24             Java     78    Pune

**Queary based condition**

In [243]:
d=df[df.Marks>90]
d

          Name  Roll_No   age          Subject  Marks Address
101  Vaishnavi      1.0  21.0           Python   91.0    Pune
103     Ritesh      3.0  22.0             Java   94.0    Pune
105     Rohini      5.0  21.0             UiUx   98.0    Pune
106    Vaibhav      6.0  21.0  Web Development   93.0    Pune
107     Khushi      7.0  22.0             Java   92.0    Pune
113      Rashi     13.0  21.0             Java   97.0    Pune
117     Jasmin     17.0  21.0             UiUx   92.0    Pune
118     Mukesh     18.0  20.0   Data Analytics   91.0    Pune
126     Ritesh      3.0  22.0             Java   94.0    Pune

In [222]:
df[df.Subject=='Java'][df.Marks>90][['Roll_No','Name']]

C:\Users\manka\AppData\Local\Temp\ipykernel_11016\3699659707.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df.Subject=='Java'][df.Marks>90][['Roll_No','Name']]

     Roll_No    Name
103        3  Ritesh
107        7  Khushi
113       13   Rashi

In [223]:
df.query('Marks<70' and 'Marks>90')

          Name  Roll_No  age          Subject  Marks Address
101  Vaishnavi        1   21           Python     91    Pune
103     Ritesh        3   22             Java     94    Pune
105     Rohini        5   21             UiUx     98    Pune
106    Vaibhav        6   21  Web Development     93    Pune
107     Khushi        7   22             Java     92    Pune
113      Rashi       13   21             Java     97    Pune
117     Jasmin       17   21             UiUx     92    Pune
118     Mukesh       18   20   Data Analytics     91    Pune

In [224]:
df.query('Subject=="UiUx"')

        Name  Roll_No  age Subject  Marks Address
105   Rohini        5   21    UiUx     98    Pune
111    Rohit       11   20    UiUx     78    Pune
117   Jasmin       17   21    UiUx     92    Pune
120  Sidhart       20   19    UiUx     63    Pune

**Important Function**

###### adding null and duplicate value

In [225]:
df.loc[122]=['soni',21,24,np.nan,78,np.nan]

In [226]:
df.loc[123]=[np.nan,21,24,np.nan,78,np.nan]

In [227]:
df.loc[124]=['tina',21,24,np.nan,78,np.nan]

In [228]:
df.loc[125]=df.loc[112]

In [229]:
df.loc[126]=df.loc[103]

In [230]:
df

          Name  Roll_No   age          Subject  Marks Address
101  Vaishnavi      1.0  21.0           Python   91.0    Pune
102      Mayur      2.0  20.0  Web Development   90.0    Pune
103     Ritesh      3.0  22.0             Java   94.0    Pune
105     Rohini      5.0  21.0             UiUx   98.0    Pune
106    Vaibhav      6.0  21.0  Web Development   93.0    Pune
107     Khushi      7.0  22.0             Java   92.0    Pune
108     Sayali      8.0  20.0   Data Analytics   81.0    Pune
109      Divya      9.0  19.0             Java   88.0    Pune
110     Kartik     10.0  19.0  Web Development   79.0    Pune
111      Rohit     11.0  20.0             UiUx   78.0    Pune
112      Abhir     12.0  20.0             Java   89.0    Pune
113      Rashi     13.0  21.0             Java   97.0    Pune
114   Anshuman     14.0  18.0  Web Development   67.0    Pune
115    Harshal     15.0  19.0   Data Analytics   69.0    Pune
116     Sakshi     16.0  22.0             Java   78.0    Pune
117     Jasmin     17.0  21.0             UiUx   92.0    Pune
118     Mukesh     18.0  20.0   Data Analytics   91.0    Pune
119      Arjun     19.0  19.0             Java   71.0    Pune
120    Sidhart     20.0  19.0             UiUx   63.0    Pune
121       soni     21.0  24.0             Java   78.0    Pune
122       soni     21.0  24.0              NaN   78.0     NaN
123        NaN     21.0  24.0              NaN   78.0     NaN
124       tina     21.0  24.0              NaN   78.0     NaN
125      Abhir     12.0  20.0             Java   89.0    Pune
126     Ritesh      3.0  22.0             Java   94.0    Pune

In [231]:
df.isnull().sum()

Name       1
Roll_No    0
age        0
Subject    3
Marks      0
Address    3
dtype: int64

In [232]:
df.duplicated().sum()

np.int64(2)

**unique value**

In [233]:
df.nunique()

Name       21
Roll_No    20
age         6
Subject     5
Marks      16
Address     1
dtype: int64

In [250]:
df['Subject'].unique()

array(['Python', 'Web Development', 'Java', 'UiUx', 'Data Analytics', nan],
      dtype=object)

In [251]:
df['Marks'].unique()

array([91., 90., 94., 98., 93., 92., 81., 88., 79., 78., 89., 97., 67.,
       69., 71., 63.])

In [236]:
df['age'].nunique()

6

In [237]:
df['Name'].nunique()

21

**Sorting**

In [238]:
df.sort_index()  # default ascending

          Name  Roll_No   age          Subject  Marks Address
101  Vaishnavi      1.0  21.0           Python   91.0    Pune
102      Mayur      2.0  20.0  Web Development   90.0    Pune
103     Ritesh      3.0  22.0             Java   94.0    Pune
105     Rohini      5.0  21.0             UiUx   98.0    Pune
106    Vaibhav      6.0  21.0  Web Development   93.0    Pune
107     Khushi      7.0  22.0             Java   92.0    Pune
108     Sayali      8.0  20.0   Data Analytics   81.0    Pune
109      Divya      9.0  19.0             Java   88.0    Pune
110     Kartik     10.0  19.0  Web Development   79.0    Pune
111      Rohit     11.0  20.0             UiUx   78.0    Pune
112      Abhir     12.0  20.0             Java   89.0    Pune
113      Rashi     13.0  21.0             Java   97.0    Pune
114   Anshuman     14.0  18.0  Web Development   67.0    Pune
115    Harshal     15.0  19.0   Data Analytics   69.0    Pune
116     Sakshi     16.0  22.0             Java   78.0    Pune
117     Jasmin     17.0  21.0             UiUx   92.0    Pune
118     Mukesh     18.0  20.0   Data Analytics   91.0    Pune
119      Arjun     19.0  19.0             Java   71.0    Pune
120    Sidhart     20.0  19.0             UiUx   63.0    Pune
121       soni     21.0  24.0             Java   78.0    Pune
122       soni     21.0  24.0              NaN   78.0     NaN
123        NaN     21.0  24.0              NaN   78.0     NaN
124       tina     21.0  24.0              NaN   78.0     NaN
125      Abhir     12.0  20.0             Java   89.0    Pune
126     Ritesh      3.0  22.0             Java   94.0    Pune

In [239]:
df.sort_index(ascending=False)    # descending

          Name  Roll_No   age          Subject  Marks Address
126     Ritesh      3.0  22.0             Java   94.0    Pune
125      Abhir     12.0  20.0             Java   89.0    Pune
124       tina     21.0  24.0              NaN   78.0     NaN
123        NaN     21.0  24.0              NaN   78.0     NaN
122       soni     21.0  24.0              NaN   78.0     NaN
121       soni     21.0  24.0             Java   78.0    Pune
120    Sidhart     20.0  19.0             UiUx   63.0    Pune
119      Arjun     19.0  19.0             Java   71.0    Pune
118     Mukesh     18.0  20.0   Data Analytics   91.0    Pune
117     Jasmin     17.0  21.0             UiUx   92.0    Pune
116     Sakshi     16.0  22.0             Java   78.0    Pune
115    Harshal     15.0  19.0   Data Analytics   69.0    Pune
114   Anshuman     14.0  18.0  Web Development   67.0    Pune
113      Rashi     13.0  21.0             Java   97.0    Pune
112      Abhir     12.0  20.0             Java   89.0    Pune
111      Rohit     11.0  20.0             UiUx   78.0    Pune
110     Kartik     10.0  19.0  Web Development   79.0    Pune
109      Divya      9.0  19.0             Java   88.0    Pune
108     Sayali      8.0  20.0   Data Analytics   81.0    Pune
107     Khushi      7.0  22.0             Java   92.0    Pune
106    Vaibhav      6.0  21.0  Web Development   93.0    Pune
105     Rohini      5.0  21.0             UiUx   98.0    Pune
103     Ritesh      3.0  22.0             Java   94.0    Pune
102      Mayur      2.0  20.0  Web Development   90.0    Pune
101  Vaishnavi      1.0  21.0           Python   91.0    Pune

In [240]:
df.sort_values(by='Marks',ascending=False).head()

        Name  Roll_No   age          Subject  Marks Address
105   Rohini      5.0  21.0             UiUx   98.0    Pune
113    Rashi     13.0  21.0             Java   97.0    Pune
103   Ritesh      3.0  22.0             Java   94.0    Pune
126   Ritesh      3.0  22.0             Java   94.0    Pune
106  Vaibhav      6.0  21.0  Web Development   93.0    Pune

**join table**

In [241]:
pd.concat((df,df))

          Name  Roll_No   age          Subject  Marks Address
101  Vaishnavi      1.0  21.0           Python   91.0    Pune
102      Mayur      2.0  20.0  Web Development   90.0    Pune
103     Ritesh      3.0  22.0             Java   94.0    Pune
105     Rohini      5.0  21.0             UiUx   98.0    Pune
106    Vaibhav      6.0  21.0  Web Development   93.0    Pune
107     Khushi      7.0  22.0             Java   92.0    Pune
108     Sayali      8.0  20.0   Data Analytics   81.0    Pune
109      Divya      9.0  19.0             Java   88.0    Pune
110     Kartik     10.0  19.0  Web Development   79.0    Pune
111      Rohit     11.0  20.0             UiUx   78.0    Pune
112      Abhir     12.0  20.0             Java   89.0    Pune
113      Rashi     13.0  21.0             Java   97.0    Pune
114   Anshuman     14.0  18.0  Web Development   67.0    Pune
115    Harshal     15.0  19.0   Data Analytics   69.0    Pune
116     Sakshi     16.0  22.0             Java   78.0    Pune
117     Jasmin     17.0  21.0             UiUx   92.0    Pune
118     Mukesh     18.0  20.0   Data Analytics   91.0    Pune
119      Arjun     19.0  19.0             Java   71.0    Pune
120    Sidhart     20.0  19.0             UiUx   63.0    Pune
121       soni     21.0  24.0             Java   78.0    Pune
122       soni     21.0  24.0              NaN   78.0     NaN
123        NaN     21.0  24.0              NaN   78.0     NaN
124       tina     21.0  24.0              NaN   78.0     NaN
125      Abhir     12.0  20.0             Java   89.0    Pune
126     Ritesh      3.0  22.0             Java   94.0    Pune
101  Vaishnavi      1.0  21.0           Python   91.0    Pune
102      Mayur      2.0  20.0  Web Development   90.0    Pune
103     Ritesh      3.0  22.0             Java   94.0    Pune
105     Rohini      5.0  21.0             UiUx   98.0    Pune
106    Vaibhav      6.0  21.0  Web Development   93.0    Pune
107     Khushi      7.0  22.0             Java   92.0    Pune
108     Sayali      8.0  20.0   Data Analytics   81.0    Pune
109      Divya      9.0  19.0             Java   88.0    Pune
110     Kartik     10.0  19.0  Web Development   79.0    Pune
111      Rohit     11.0  20.0             UiUx   78.0    Pune
112      Abhir     12.0  20.0             Java   89.0    Pune
113      Rashi     13.0  21.0             Java   97.0    Pune
114   Anshuman     14.0  18.0  Web Development   67.0    Pune
115    Harshal     15.0  19.0   Data Analytics   69.0    Pune
116     Sakshi     16.0  22.0             Java   78.0    Pune
117     Jasmin     17.0  21.0             UiUx   92.0    Pune
118     Mukesh     18.0  20.0   Data Analytics   91.0    Pune
119      Arjun     19.0  19.0             Java   71.0    Pune
120    Sidhart     20.0  19.0             UiUx   63.0    Pune
121       soni     21.0  24.0             Java   78.0    Pune
122       soni     21.0  24.0              NaN   78.0     NaN
123        NaN     21.0  24.0              NaN   78.0     NaN
124       tina     21.0  24.0              NaN   78.0     NaN
125      Abhir     12.0  20.0             Java   89.0    Pune
126     Ritesh      3.0  22.0             Java   94.0    Pune

**Stastical operation**

In [242]:
df.describe()

         Roll_No        age      Marks
count  25.000000  25.000000  25.000000
mean   12.200000  20.880000  83.840000
std     6.614378   1.763519   9.889725
min     1.000000  18.000000  63.000000
25%     7.000000  20.000000  78.000000
50%    12.000000  21.000000  88.000000
75%    18.000000  22.000000  92.000000
max    21.000000  24.000000  98.000000